
# if~else와 elif 구문
## else 조건문의 활용
else 구문은 if 조건문 뒤에 사용하며, if 조건문의 조건이 거짓일 때 실행되는 부분
```
if 조건:
  조건이 참일 때 실행할 문장
else:
  조건이 거짓일 때 실행할 문장
```
```
# 입력을 받음
number = input("정수 입력> ")
number = int(number)

# 조건문을 사용
if number % 2 == 0:
  # 조건이 참일 때, 즉 짝수 조건
  print("짝수입니다")
else:
  # 조건이 거짓일 때, 즉 홀수 조건
  print("홀수입니다")
```
조건문이 2가지로만 구분될 때 if else 구문을 사용하면 조건 비교를 한 번만 하므로 이전의 코드보다 2배 효율적.

## elif 구문
3개 이상의 조건을 연결해서 사용하는 elif구문은 if 조건문과 else 구문 사이에 입력.
```
if 조건A:
  조건A가 참일 때 실행할 문장
elif 조건B:
  조건B가 참일 때 실행할 문장
elif 조건C:
  조건C가 참일 때 실행할 문장
else:
  모든 조건이 거짓일 때 문장
```
```
# 날짜/시간과 관련된 기능
import datetime

# 현재 날짜/시간을 구하고 쉽게 사용할 수 있게 월을 변수에 저장.
now = datetime.datetime.now()
month = now.month

# 조건문으로 계절을 확인
if 3 <= month <= 5:
  print("현재는 봄입니다.")
elif 6 <= month <= 8:
  print("현재는 여름입니다.")
elif 9 <= month <= 11:
  print("현재는 여름입니다.")
else:
  print("현재는 겨울입니다.")
```
if 조건문은 위에서 아래로 흐르며, else 구문과 elif 구문은 이전의 조건이 맞지 않을 때 넘어오는 부분. 위에서 이미 제외된 조건을 한 번 더 검사할 필요는 없음. 그러면 조건 비교를 반밖에 하지 않고, 코드의 가독성도 좀 더 향상.

## False로 변환되는 값
if 조건문의 매개변수에 불이 아닌 다른 값이 올 때는 자동으로 이를 불로 변환해서 처리. 어떤 값이 True로 변환되고, 어떤 값이 False로 변환되는지 알고 있어야 코드를 이해할 수 있음. False로 변환되는 값은 None, 숫자 0과 0.0, 빈 컨테이너(빈 문자열, 빈 바이트열, 빈 리스트, 빈 튜플, 빈 딕셔너리 등). 그 외는 모두 True 변환.

## pass 키워드
프로그래밍을 하다 보면 일단 프로그래밍의 전체 골격을 잡아 놓고 내부에서 처리할 내용은 차근차근 생각하며 만들겠다는 의도로 코딩하는 경우가 있음. 이때 골격은 일반적으로 조건문, 반복문, 함수, 클래스 등의 기본 구문.
```
if zero == 0:

else:

```
아무 내용도 작성하지 않아도 실행이 정상적으로 됨. 파이썬의 경우에는 if 조건문 사이에는 무조건 들여쓰기 4칸을 넣고 코드를 작성해야만 구문이 성립되기 때문에 위와 같이 작성한 경우에는 IndentationError(들여쓰기가 잘못됨). 이때, pass라는 키워드를 사용.
```
# 입력 받음.
number = input("정수 입력> ")
number = int(number)

# 조건문 사용.
if number > 0:
  pass
else:
  pass
```
pass 키워드 작성을 잊어버렸을 경우 raise NotImplementedError도 입력 가능.
